In [2]:
import numpy as np
import pandas as pd

In [5]:
np.__version__

'1.24.2'

In [7]:
data = {'A': [1,2,None,5], 'B': [None, 21, 19, 18], 'C': [None, 21, None, 18]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

     A     B     C
0  1.0   NaN   NaN
1  2.0  21.0  21.0
2  NaN  19.0   NaN
3  5.0  18.0  18.0

In [10]:
df.isna().sum()

A    1
B    1
C    2
dtype: int64

In [11]:
df.isna()

       A      B      C
0  False   True   True
1  False  False  False
2   True  False   True
3  False  False  False

In [12]:
df.dropna()

     A     B     C
1  2.0  21.0  21.0
3  5.0  18.0  18.0

In [14]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

**Data Visualization**